# SpaceTagFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceTagFilter Constructor
SpaceTagFilter Class See Also
---
Constructs a filter which matches only spaces.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceTagFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SpaceTagFilter()
```

# See Also
SpaceTagFilter Class
Autodesk.Revit.DB.Mechanical Namespace